Ran Plan for 2 projects:

1. project: `init/tfplayground` dir: `terraform-provisioning/terraform/init/tfplayground` workspace: `default`
1. project: `ecr/gyanni/ap-northeast-2` dir: `terraform-provisioning/terraform/ecr/gyanni/ap-northeast-2` workspace: `default`

### 1. project: `init/tfplayground` dir: `terraform-provisioning/terraform/init/tfplayground` workspace: `default`
**Plan Error**
```
running "/home/atlantis/.atlantis/bin/terraform1.3.7 plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/Gyanni/terraform-playground/1/default/terraform-provisioning/terraform/init/tfplayground/init::tfplayground-default.tfplan\" -var 'assume_role_arn=arn:aws:iam::289574460446:role/atlantis-gyanni-admin'" in "/home/atlantis/.atlantis/repos/Gyanni/terraform-playground/1/default/terraform-provisioning/terraform/init/tfplayground": exit status 1

Error: Value for undeclared variable

A variable named "assume_role_arn" was assigned on the command line, but the
root module does not declare a variable of that name. To use this value, add
a "variable" block to the configuration.

```

---
### 2. project: `ecr/gyanni/ap-northeast-2` dir: `terraform-provisioning/terraform/ecr/gyanni/ap-northeast-2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecr_repository.demoapp will be created
+ resource "aws_ecr_repository" "demoapp" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "demoapp"
      + region               = "ap-northeast-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.tfplayground will be created
+ resource "aws_ecr_repository" "tfplayground" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "tfplayground"
      + region               = "ap-northeast-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.demoapp will be created
+ resource "aws_ecr_repository_policy" "demoapp" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + region      = "ap-northeast-2"
      + registry_id = (known after apply)
      + repository  = "demoapp"
    }

  # aws_ecr_repository_policy.tfplayground will be created
+ resource "aws_ecr_repository_policy" "tfplayground" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + region      = "ap-northeast-2"
      + registry_id = (known after apply)
      + repository  = "tfplayground"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---

